// ლოგიკური ოპერატორები

// 0) || (ან), && (და), ! (არა), ??
/////////////////////////

// 1) || (ან)
//////////////////

/*

let hour = 12;
let isWeekend = true;

if (hour < 10 || hour > 18 || isWeekend) {
  alert("ოფისი დახურულია");
}

*/

// ან - ის ჯაჭვი || დააბრუნებს პირველ ჭეშმარიტ მნიშვნელობას ან ბოლო, თუ ვერ იქნა ნაპოვნი ჭეშმარიტების მნიშვნელობა.

/*

let user1 = "tazo";
let user2 = "gio";
let user3 = "ilia";

alert(user1 || user2 || user3 || "aravin");

*/

// 2) && (და)   ampersands
//////////////////////////

/*
let hour = 15;
let friday = true;

if (hour == 16 && friday) {
  alert("ოფისი დახურულია");
} else {
  alert("ოფისი ღიაა");
}
*/

// alert(1 && 0 && 3)

// და && უფრო მაღალია ვიდრე OR ||
// ასე რომ კოდი a && b || c && d არსებითად იგივეა,
// რაც && გამონათქვამები ფრჩხილებში იყო: (a && b) || (c && d).

// 3) ! (არა)

/*

let friday = "ხუთშაბათი";

if (friday !== "კვირა") {
  alert("ოფისი ღიაა");
}

*/
