// გამეორება
///////////

/*
აჩვენებს შეტყობინებას
prompt("title", "100");

აჩვენებს შეტყობინებას, რომელიც მომხმარებელს სთხოვს ტექსტის შეყვანას
alert("Hello");

აჩვენებს შეტყობინებას და ელოდება მომხმარებელს დააჭირეთ ღილაკს
confirm("question");

console.log("jkbdsk");

*/

// პირობითი ოპერატორი if (?)

// 1) “ if ” განცხადება

// The if(...) განცხადება აფასებს მდგომარეობას ფრჩხილებში და, თუ შედეგი არის true, ასრულებს კოდის ბლოკს.
////////////////////////////////////////////////
/* 

let year = prompt("რამდენი წლის ვიქნები მე?");

if (year == 16) alert("მართალია");


if (year == 15) {
  alert("That's correct!");
  alert("You're so smart!");
}


let cond = (year == 2015);

if (cond) {
    alert("მართალია");
}

*/

// 2) “ else ” პუნქტი
//////////////////////////////

/* 

let year = prompt("რამდენი წლის ვიქნები მე?", "");

if (year == 16) {
  alert("მართალია!");
} else {
  alert("შენ შეცდომა დაუშვი?"); // any value except 2015
}

*/

// 3) რამდენიმე პირობა: “ else if ”
//////////////////////////////
/* 

let year = prompt("რამდენი წლის ვიქნები მე?");

if (year == 16) {
  alert("მართალია");
} else if (year > 16) {
  alert("უფრო ნაკლების");
} else {
  alert("უფრო მეტის");
}

*/

// 4) პირობითი ოპერატორი ‘ ? ’
//////////////////////////////////////

/*

let year = prompt("რამდენი წლის ვიქნები მე?");

let testAlert =
  year == 16 ? "მართალია" : year > 16 ? "უფრო ნაკლების" : "უფრო მეტის";

alert(testAlert);

*/
